RT-Thread/rt-thread/bsp/efm32/Libraries/emlib/inc/em_opamp.h
/** Configuration of OPA1 in cascaded non-inverting amplifier mode.    */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA1                                      \
  {                                                                               \
    opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
    opaPosSelOpaIn,                 /* Pos input from OPA0 output.             */ \
    opaOutModeAll,                  /* Both main and alternate outputs.        */ \
    opaResSelR2eq0_33R1,            /* R2 = 1/3 R1                             */ \
    opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
    0,                              /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    true,                           /* Pass output to next stage (OPA2).       */ \
    true,                           /* Neg pad enabled, used as signal ground. */ \
    false,                          /* Pos pad disabled.                       */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA2 in cascaded non-inverting amplifier mode.    */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA2                                      \
  {                                                                               \
    opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
    opaPosSelOpaIn,                 /* Pos input from OPA1 output.             */ \
    opaOutModeMain,                 /* Main output enabled.                    */ \
    opaResSelR2eq0_33R1,            /* R2 = 1/3 R1                             */ \
    opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
    DAC_OPA0MUX_OUTPEN_OUT0,        /* Alternate output 0 enabled.             */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    false,                          /* No nextout output enabled.              */ \
    true,                           /* Neg pad enabled, used as signal ground. */ \
    false,                          /* Pos pad disabled.                       */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA0 in cascaded inverting amplifier mode.        */
#define OPA_INIT_CASCADED_INVERTING_OPA0                                          \
  {                                                                               \
    opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,                /* Pos input from pad.                     */ \
    opaOutModeAll,                  /* Both main and alternate outputs.        */ \
    opaResSelR2eqR1,                /* R2 = R1                                 */ \
    opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
    0,                              /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    true,                           /* Pass output to next stage (OPA1).       */ \
    true,                           /* Neg pad enabled, used as signal input.  */ \
    true,                           /* Pos pad enabled, used as signal ground. */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in cascaded inverting amplifier mode.        */
#define OPA_INIT_CASCADED_INVERTING_OPA1                                          \
  {                                                                               \
    opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,                /* Pos input from pad.                     */ \
    opaOutModeAll,                  /* Both main and alternate outputs.        */ \
    opaResSelR2eqR1,                /* R2 = R1                                 */ \
    opaResInMuxOpaIn,               /* Resistor ladder input from OPA0.        */ \
    0,                              /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    true,                           /* Pass output to next stage (OPA2).       */ \
    false,                          /* Neg pad disabled.                       */ \
    true,                           /* Pos pad enabled, used as signal ground. */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA2 in cascaded inverting amplifier mode.        */
#define OPA_INIT_CASCADED_INVERTING_OPA2                                          \
  {                                                                               \
    opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,                /* Pos input from pad.                     */ \
    opaOutModeMain,                 /* Main output enabled.                    */ \
    opaResSelR2eqR1,                /* R2 = R1                                 */ \
    opaResInMuxOpaIn,               /* Resistor ladder input from OPA1.        */ \
    DAC_OPA0MUX_OUTPEN_OUT0,        /* Alternate output 0 enabled.             */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    false,                          /* No nextout output enabled.              */ \
    false,                          /* Neg pad disabled.                       */ \
    true,                           /* Pos pad enabled, used as signal ground. */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA0 in two-opamp differential driver mode.       */
#define OPA_INIT_DIFF_DRIVER_OPA0                                                 \
  {                                                                               \
    opaNegSelUnityGain,             /* Unity gain.                             */ \
    opaPosSelPosPad,                /* Pos input from pad.                     */ \
    opaOutModeAll,                  /* Both main and alternate outputs.        */ \
    opaResSelDefault,               /* Resistor ladder is not used.            */ \
    opaResInMuxDisable,             /* Resistor ladder disabled.               */ \
    0,                              /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    true,                           /* Pass output to next stage (OPA1).       */ \
    false,                          /* Neg pad disabled.                       */ \
    true,                           /* Pos pad enabled, used as signal input.  */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in two-opamp differential driver mode.       */
#define OPA_INIT_DIFF_DRIVER_OPA1                                                 \
  {                                                                               \
    opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
    opaPosSelPosPad,                /* Pos input from pad.                     */ \
    opaOutModeMain,                 /* Main output enabled.                    */ \
    opaResSelR2eqR1,                /* R2 = R1                                 */ \
    opaResInMuxOpaIn,               /* Resistor ladder input from OPA0.        */ \
    0,                              /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    false,                          /* No nextout output enabled.              */ \
    false,                          /* Neg pad disabled.                       */ \
    true,                           /* Pos pad enabled, used as signal ground. */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

