RT-Thread/rt-thread/bsp/efm32/Libraries/emlib/inc/em_opamp.h
/** Configuration of OPA0 in three-opamp differential receiver mode.   */
#define OPA_INIT_DIFF_RECEIVER_OPA0                                               \
  {                                                                               \
    opaNegSelUnityGain,             /* Unity gain.                             */ \
    opaPosSelPosPad,                /* Pos input from pad.                     */ \
    opaOutModeAll,                  /* Both main and alternate outputs.        */ \
    opaResSelR2eqR1,                /* R2 = R1                                 */ \
    opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
    0,                              /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    true,                           /* Pass output to next stage (OPA2).       */ \
    true,                           /* Neg pad enabled, used as signal ground. */ \
    true,                           /* Pos pad enabled, used as signal input.  */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA1 in three-opamp differential receiver mode.   */
#define OPA_INIT_DIFF_RECEIVER_OPA1                                               \
  {                                                                               \
    opaNegSelUnityGain,             /* Unity gain.                             */ \
    opaPosSelPosPad,                /* Pos input from pad.                     */ \
    opaOutModeAll,                  /* Both main and alternate outputs.        */ \
    opaResSelDefault,               /* Resistor ladder is not used.            */ \
    opaResInMuxDisable,             /* Disable resistor ladder.                */ \
    0,                              /* No alternate outputs enabled.           */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    true,                           /* Pass output to next stage (OPA2).       */ \
    false,                          /* Neg pad disabled.                       */ \
    true,                           /* Pos pad enabled, used as signal input.  */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/** Configuration of OPA2 in three-opamp differential receiver mode.   */
#define OPA_INIT_DIFF_RECEIVER_OPA2                                               \
  {                                                                               \
    opaNegSelResTap,                /* Input from resistor ladder tap.         */ \
    opaPosSelResTapOpa0,            /* Input from OPA0 resistor ladder tap.    */ \
    opaOutModeMain,                 /* Main output enabled.                    */ \
    opaResSelR2eqR1,                /* R2 = R1                                 */ \
    opaResInMuxOpaIn,               /* Resistor ladder input from OPA1.        */ \
    DAC_OPA0MUX_OUTPEN_OUT0,        /* Enable alternate output 0.              */ \
    _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.             */       \
    _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.        */       \
    false,                          /* No low pass filter on pos pad.          */ \
    false,                          /* No low pass filter on neg pad.          */ \
    false,                          /* No nextout output enabled.              */ \
    false,                          /* Neg pad disabled.                       */ \
    false,                          /* Pos pad disabled.                       */ \
    false,                          /* No shorting of inputs.                  */ \
    false,                          /* Rail-to-rail input enabled.             */ \
    true,                           /* Use factory calibrated opamp offset.    */ \
    0                               /* Opamp offset value (not used).          */ \
  }

/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/

void      OPAMP_Disable(DAC_TypeDef *dac, OPAMP_TypeDef opa);
void      OPAMP_Enable(DAC_TypeDef *dac, OPAMP_TypeDef opa, const OPAMP_Init_TypeDef *init);

/** @} (end addtogroup OPAMP) */
/** @} (end addtogroup EM_Library) */

#ifdef __cplusplus
}
#endif

#endif /* defined( OPAMP_PRESENT ) && ( OPAMP_COUNT == 1 ) */
#endif /* __EM_DAC_H */
